In [2]:
import pandas as pd

In [3]:
data={'state':['Ohio','Ohio','Ohio', 'Nevada','Nevada','Nevada'],
     'year':[2000,2001,2002, 2000,2001,2002],
     'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

In [4]:
frame=pd.DataFrame(data)

In [5]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2000  2.4
4  Nevada  2001  2.9
5  Nevada  2002  3.2

In [6]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2000  2.4
4  Nevada  2001  2.9

In [7]:
pd.DataFrame(data, columns=['pop','state','year'])

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2000
4  2.9  Nevada  2001
5  3.2  Nevada  2002

In [8]:
frame2=pd.DataFrame(data,columns=['year','state','pop','debt'],
                   index=['one','two','three','four','five','six'])

In [9]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2000  Nevada  2.4  NaN
five   2001  Nevada  2.9  NaN
six    2002  Nevada  3.2  NaN

In [10]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [11]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [12]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [13]:
frame2.year

one      2000
two      2001
three    2002
four     2000
five     2001
six      2002
Name: year, dtype: int64

In [14]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [15]:
frame2['debt']=20

In [16]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5    20
two    2001    Ohio  1.7    20
three  2002    Ohio  3.6    20
four   2000  Nevada  2.4    20
five   2001  Nevada  2.9    20
six    2002  Nevada  3.2    20

In [17]:
import numpy as np

In [18]:
frame2['debt']=np.arange(6)

In [19]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2000  Nevada  2.4     3
five   2001  Nevada  2.9     4
six    2002  Nevada  3.2     5

In [20]:
val=pd.Series([-1.2, -1.5, -1.7], index=['two','four','five'])

In [21]:
frame2['debt']=val

In [22]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2000  Nevada  2.4  -1.5
five   2001  Nevada  2.9  -1.7
six    2002  Nevada  3.2   NaN

In [23]:
frame2['eastern']=(frame2.state=='Ohio')

In [24]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2000  Nevada  2.4  -1.5    False
five   2001  Nevada  2.9  -1.7    False
six    2002  Nevada  3.2   NaN    False

In [25]:
del frame2['eastern']

In [26]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2000  Nevada  2.4  -1.5
five   2001  Nevada  2.9  -1.7
six    2002  Nevada  3.2   NaN

In [27]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2000, 'Nevada', 2.4, -1.5],
       [2001, 'Nevada', 2.9, -1.7],
       [2002, 'Nevada', 3.2, nan]], dtype=object)